src/cf/Catalogs/ЦС_TelegramID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЦС_TelegramID</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TelegramID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнфорамция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_МестонахождениеСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьВсеСклады</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЦС_TelegramID/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Функция ПриОткрытииНаСервере()
	ТелефонМенеджераК = Константы.ЦС_ТелефонМенеджера.Получить();
	Возврат ТелефонМенеджераК; 
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
Телефон = ПриОткрытииНаСервере();
Объект.ТелефонМенеджера = Телефон;
Если Объект.ПоказатьВсеСклады тогда
	Элементы.Местонаходение.Доступность = Ложь иначе
		Элементы.Местонаходение.Доступность = Истина; 
	КонецЕсли;		
КонецПроцедуры


&НаСервере
Процедура ТелефонМенеджераПриИзмененииНаСервере(ТелефонМенеджера)
Константы.ЦС_ТелефонМенеджера.Установить(ТелефонМенеджера);	
	
КонецПроцедуры


&НаКлиенте
Процедура ТелефонМенеджераПриИзменении(Элемент)
	Телефон = Объект.ТелефонМенеджера;
	ТелефонМенеджераПриИзмененииНаСервере(Телефон);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = Объект.Пользователь;
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсеСкладыПриИзменении(Элемент)
	Если Объект.ПоказатьВсеСклады тогда
	Элементы.Местонаходение.Доступность = Ложь иначе
		Элементы.Местонаходение.Доступность = Истина; 
	КонецЕсли;	
	КонецПроцедуры
